Revit 2027 API
NestedFamilyTypeReference.TypeName Property
 Type of the referenced family
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string TypeName { get; }
Public ReadOnly Property TypeName As String
	Get
public:
property String^ TypeName {
	String^ get ();
}
member TypeName : string with get
Property Value
String
See Also
Reference
NestedFamilyTypeReference Class
Autodesk.Revit.DB Namespace